app/views/ratings/_form.html.erb

    <div class="input-group rating">
        <%= f.select :rating, 1...6, class: "input-group-field" %>
---
SELECT resource_id, avg(rating) as avg_rating FROM "ratings" WHERE (resource_id = 9) ORDER BY "ratings"."id" ASC LIMIT ?  [["LIMIT", 1]]