app/helpers/ratings_helper.rb

    def user_rating_or_form
        if @resource.users.include?(current_user)
            content_tag(:p, "Your Rating: #{@resource.ratings.find_by(user_id: current_user.id).rating}")
---
SELECT 1 AS one FROM "users" INNER JOIN "ratings" ON "users"."id" = "ratings"."user_id" WHERE "ratings"."resource_id" = ? AND "users"."id" = ? LIMIT ?  [["resource_id", 9], ["id", 3], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."resource_id" = ? AND "ratings"."user_id" = ? LIMIT ?  [["resource_id", 7], ["user_id", 3], ["LIMIT", 1]]