app/helpers/resources_helper.rb

SELECT "resources".* FROM "resources" ORDER BY name
---
    def resource_list_index(object)
        if object.resources.empty?