app/views/resources/show.html.erb

<p>Categories:
    <% @resource.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "resource_categories" ON "categories"."id" = "resource_categories"."category_id" WHERE "resource_categories"."resource_id" = ?  [["resource_id", 1]]

    <div class="input-group rating">
        <%= f.select :rating, 1...6, class: "input-group-field" %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."resource_id" = ? ORDER BY "ratings"."id" ASC LIMIT ?  [["resource_id", 7], ["LIMIT", 1]]
SELECT AVG("ratings"."rating") FROM "ratings" WHERE (resource_id = 7)