app/controllers/categories_controller.rb

    def index
        @categories = Category.all
---
SELECT "categories".* FROM "categories" ORDER BY name