app/controllers/categories_controller.rb

    def create
        @category = Category.new(category_params)
        if @category.valid?
            @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "testing"], ["created_at", "2021-04-29 02:49:09.555967"], ["updated_at", "2021-04-29 02:49:09.555967"]]

    def set_category
        @category = Category.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]