app/controllers/organizations_controller.rb

    def index
        @organizations = Organization.all
---
SELECT "organizations".* FROM "organizations" ORDER BY name

    def create
        @organization = Organization.new(organization_params)
        if @organization.valid?
            @organization.save
---
INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2021-04-20 00:12:58.416048"], ["updated_at", "2021-04-20 00:12:58.416048"]]

    def update
        set_organization
        if @organization.update(organization_params)
---
UPDATE "organizations" SET "name" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["name", "Newbies"], ["updated_at", "2021-05-01 20:11:50.442350"], ["id", 12]]

    def destroy
        set_organization.destroy
---
DELETE FROM "organizations" WHERE "organizations"."id" = ?  [["id", 11]]

    def set_organization
        @organization = Organization.find_by(id: params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]