app/controllers/ratings_controller.rb

    def create
        rating = Rating.new(user_id: current_user.id, resource_id: params[:resource_id], rating: params[:rating])
        if rating.valid?
            rating.save
---
INSERT INTO "ratings" ("user_id", "resource_id", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["resource_id", 7], ["rating", 2], ["created_at", "2021-04-27 01:06:06.864265"], ["updated_at", "2021-04-27 01:06:06.864265"]]