app/controllers/resources_controller.rb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        if nested_resource?
            if !Organization.exists?(params[:organization_id])
                redirect_to organizations_path, alert: "Organization not found."
            else
                @organization = Organization.find_by(id: params[:organization_id])

UPDATE "resources" SET "organization_id" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["organization_id", 5], ["updated_at", "2021-04-17 22:51:44.123216"], ["id", 7]]
---
    def update
        if @resource.update(resource_params)

SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def set_resource
        @resource = Resource.find_by(id: params[:id])