app/controllers/resources_controller.rb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."organization_id" = ? LIMIT ?  [["organization_id", "2"], ["LIMIT", 1]]
SELECT "resources".* FROM "resources" WHERE "resources"."organization_id" = ? ORDER BY "resources"."name" ASC  [["organization_id", 2]]
---
    def index
        if params[:organization_id]
            # byebug
            @organization = Organization.find_by(id: params[:organization_id])
            @resources = @organization.resources.order(name: :asc)

SELECT "organizations".* FROM "organizations" ORDER BY name
SELECT "categories".* FROM "categories" ORDER BY name
---
    def new
        # byebug
        if params[:organization_id] && !Organization.exists?(params[:organization_id])
            redirect_to organizations_path, alert: "Organization not found."
        else
            @resource = Resource.new(organization_id: params[:organization_id])
            @categories = Category.all

INSERT INTO "resources" ("name", "amount", "link", "description", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "organizations".* FROM "organizations"
SELECT "categories".* FROM "categories"
---
    def create
        # byebug
        @resource = Resource.new(resource_params)
        if @resource.valid?
            @resource.save
            redirect_to resource_path(@resource)
        else
            @organizations = Organization.all
            @categories = Category.all

SELECT "categories".* FROM "categories" ORDER BY name
SELECT "organizations".* FROM "organizations" ORDER BY name
---
    def edit
        set_resource
        # @category = self.categories.build
        @categories = Category.all
        @organizations = Organization.all

UPDATE "resources" SET "amount" = ?, "link" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["amount", "987"], ["link", "www.beatles.com"], ["updated_at", "2021-04-25 19:38:20.704106"], ["id", 11]]
SELECT "categories".* FROM "categories"
SELECT "organizations".* FROM "organizations"
---
    def update
        # byebug
        set_resource
        if @resource.update(resource_params)
            redirect_to resource_path(@resource)
        else
            @categories = Category.all
            @organizations = Organization.all

DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 5]]
---
    def destroy
        set_resource.destroy

SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_resource
        @resource = Resource.find_by(id: params[:id])