app/controllers/resources_controller.rb

    def update
        # byebug
        set_resource
        if @resource.update(resource_params)
---
UPDATE "resources" SET "organization_id" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["organization_id", 2], ["updated_at", "2021-04-17 20:16:13.988704"], ["id", 1]]

    def set_resource
        @resource = Resource.find_by(id: params[:id])
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]