app/controllers/sessions_controller.rb

  def omniauth
    user_info = request.env["omniauth.auth"]
    user = User.find_or_create_by(uid: user_info["uid"], provider: user_info["provider"]) do |u|
---
INSERT INTO "users" ("first_name", "last_name", "password_digest", "username", "email", "created_at", "updated_at", "uid", "provider") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT ?  [["uid", "108902299128449756034"], ["provider", "google_oauth2"], ["LIMIT", 1]]