app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "password_digest", "username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        # byebug
        @user = User.new(user_params)
        if @user.valid?
            @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @user = User.find_by(id: session[:user_id])

UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Bam"], ["updated_at", "2021-04-20 01:12:08.975057"], ["id", 3]]
---
    def update
        @user = current_user
        if user_params[:password].blank?
            user_params.delete(:password)
            user_params.delete(:password_confirmation)
        end
        if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]
---
    def destroy
        # byebug
        current_user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def require_authorization
        return head(:forbidden) unless current_user == User.find_by(id: params[:id])