app/models/organization.rb

SELECT organizations.id, sum(resources.amount) as total_amount FROM "organizations" INNER JOIN "resources" ON "resources"."organization_id" = "organizations"."id" GROUP BY "organizations"."id"
---
    scope :totals_by_organization, -> { joins(:resources).select("organizations.id, sum(resources.amount) as total_amount").group("organizations.id") }