app/models/rating.rb

    scope :average_rating, ->(id) { select("resource_id, avg(rating) as avg_rating").where("resource_id = ?", id) }
---
SELECT AVG(rating as avg_rating) FROM "ratings" WHERE (resource_id = 7)