app/models/resource.rb

SELECT resource_id, avg(rating) as avg_rating FROM "ratings" WHERE (resource_id = 10) ORDER BY "ratings"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def rating
    rating = Rating.average_rating(self.id).first.avg_rating