app/models/resource.rb

SELECT 1 AS one FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "New"], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
---
  belongs_to :organization
  has_many :resource_categories, dependent: :destroy
  has_many :categories, through: :resource_categories
  accepts_nested_attributes_for :categories, reject_if: proc { |attributes| attributes["name"].blank? }

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "New"], ["created_at", "2021-04-20 00:46:34.143678"], ["updated_at", "2021-04-20 00:46:34.143678"]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2021-05-01 20:14:42.081077"], ["updated_at", "2021-05-01 20:14:42.081077"]]
---
  def categories_attributes=(categories_attributes)
    categories_attributes.values.each do |category_attribute|
      if !category_attribute[:name].blank?
        category = Category.find_or_create_by(category_attribute)
        self.categories << category

INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Grendel Inc."], ["created_at", "2021-04-17 21:07:50.193149"], ["updated_at", "2021-04-17 21:07:50.193149"]]
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def organization=(name)
    self.organization = Organization.find_or_create_by(name: name)