app/views/organizations/show.html.erb

<ul>
    <% if @organization.resources.empty? %>
---
SELECT "resources".* FROM "resources" WHERE "resources"."organization_id" = ?  [["organization_id", 1]]
SELECT 1 AS one FROM "resources" WHERE "resources"."organization_id" = ? LIMIT ?  [["organization_id", 9], ["LIMIT", 1]]

    <% else %>
        <% @organization.resources.order(name: :asc).each do |resource| %>
---
SELECT "resources".* FROM "resources" WHERE "resources"."organization_id" = ? ORDER BY "resources"."name" ASC  [["organization_id", 2]]