app/views/categories/show.html.erb

SELECT "resources".* FROM "resources" INNER JOIN "resource_categories" ON "resources"."id" = "resource_categories"."resource_id" WHERE "resource_categories"."category_id" = ?  [["category_id", 4]]
SELECT 1 AS one FROM "resources" INNER JOIN "resource_categories" ON "resources"."id" = "resource_categories"."resource_id" WHERE "resource_categories"."category_id" = ? LIMIT ?  [["category_id", 10], ["LIMIT", 1]]
---
<ul>
<% if @category.resources.empty? %>

SELECT "resources".* FROM "resources" INNER JOIN "resource_categories" ON "resources"."id" = "resource_categories"."resource_id" WHERE "resource_categories"."category_id" = ?  [["category_id", 10]]
---
<% else %>
    <% @category.resources.each do |resource| %>